//Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох. Також потрібно врахувати коли введені рівні числа.

// let num1 = +prompt('Введи перше число:');
// let num2 = +prompt('Введи друге число:');
// if (num1 === num2) {
//     console.log('Введені числа рівні.');
// } else if (num1 > num2) {
//     console.log('Перше число більше за друге.');
// } else if (num1 < num2) {
//     console.log('Друге число більше за друге.');
// } else {
//     console.log('Ти не коректно ввів числа!');
// }


//У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flatNum = +prompt('Введи номер квартири:');
// if (flatNum >= 1 && flatNum <= 20) {
//     console.log("Дана квартира знаходиться в першому під'їзді.");
// } else if (flatNum >= 21 && flatNum <= 48) {
//     console.log("Дана квартира знаходиться в другому під'їзді.");
// } else if (flatNum >= 49 && flatNum <= 90) {
//     console.log("Дана квартира знаходиться в третьому під'їзді.");
// }  else {
//     console.log('Такої квартири немає.');
// }


//Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО.

// let number = +prompt('Введи числове значення:');
// (number === 10) ? console.log('Вірно.') :  console.log('Невірно.');


//Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let type = typeof [];    ->   object
// console.log(type);

// let x = 'Якесь значення';
// console.log(x);
// if (typeof x === 'number') {
//     console.log('1');
// } else if (typeof x === 'string') {
//     console.log('2');
// } else if (typeof x === 'boolean') {
//     console.log('3');
// } else if (typeof x === 'object') {
//     console.log('4');
// } else {
//     console.log('Ти ввів щось інше.')
// }

//Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// alert('Чи ми йдемо сьогодні в Okten на навчання?')
// let temperature = +prompt('Яка сьогодні температура:');
// if (temperature >= 10 && temperature <= 22) {
//     alert('Ми йдемо вчитися)');
// } else {
//     alert('Сидимо вдома і вчимося онлайн(');
// }


//За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let quiz = +prompt('Введи своє щасливе число:');
switch (quiz) {
    case 1 :
        alert('УРА! Ти виграв квартиру!!!');
        break;
    case 2 :
        alert('Ура! Ти виграв автомобіль.');
        break;
    case 3 :
        alert('Ура! Ти виграв ноутбук.');
        break;
    case 4 :
        alert('Ура! Ти виграв планшет.');
        break;
    case 5 :
        alert('Ура! Ти виграв телефон.');
        break;
    default:
        alert('Ти нічого не вигра(((');
}

