//Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
let quantityFriends = friends.length;
console.log('Number of all friends = ' + quantityFriends);
if (quantityFriends >= 3) {
    console.log('Це великий масив, в якому  3 і більше елементи.');
} else {
    console.log('Це маленький масив, в якому менше 3-х елементів.');
}


//Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = +prompt('Введи перше число:');
// let num2 = +prompt('Введи друге число:');
// let num3 = +prompt('Введи третє число:');
// if (num1 > num2 && num1 < num3 || num1 < num2 && num1 > num3) {
//     alert('Середнім є перше число, тобто це число ' + '"' + num1 + '". Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num2 > num1 && num2 < num3 || num2 < num1 && num2 > num3) {
//     alert('Середнім є друге число, тобто це число ' + '"' + num2 + '". Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num3 < num2 && num3 > num1 || num3 < num1 && num3 > num2) {
//     alert('Середнім є третє число, тобто це число ' + '"' + num3 + '".  Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num1 === num2 && num1 === num3 ) {
//     alert('Усі числа рівні.  Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num1 === num2  ) {
//     alert('Число один і два рівні.  Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num1 === num3  ) {
//     alert('Число один і три рівні.  Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else if (num2 === num3  ) {
//     alert('Число два і три рівні.  Твої числа: ' + '"' + num1 + '", "' + num2 + '", "' + num3 + '".');
// } else {
//     alert('Ти щось не то ввів.');
// }


//Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// (result = (a + b < 4)) ? console.log('Мало') : console.log('Багато');


//Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором


// let number = +prompt('Введи число від -100 до 100:');
// if (number >= -100 && number < 0) {
//     console.log('Твоє число негативне.');
// } else if (number > 0 && number <= 100) {
//     console.log('Твоє число позитивне.')
// } else if (number === 0) {
//     console.log('Твоє число нуль.');
// } else {
//     console.log('Ти не дотримався умов.')
// }

let num = +prompt('Введи число від -100 до 100:');
num < 0 ? console.log('Твоє число нуль.') : num > 0 ? console.log('Твоє число позитивне.') : num === 0 ? console.log('Твоє число нуль.') :     console.log('Ти не дотримався умов.');




