// Дано змінну time яка рівна числу від 0 до 59.
// Потрібно написати код, який перевірить, до якої четверті години попадає число (в першу, другу, третю или четверту частину години).

alert('Давай зіграємо в гру!')
let time = prompt("Загадай число від 0 до 59.");
while (time === '' || time === null) {
    time = prompt('Загадай число від 0 до 59.');
}
if (time >= 0 && time <= 14) {
    alert('Ти попав у першу чверть години.');
} else if (time >= 15 && time <= 29) {
    alert('Ти попав у другу чверть години.');
} else if (time >= 30 && time <= 44) {
    alert('Ти попав у третю чверть години.');
} else if (time >= 45 && time <= 59) {
    alert('Ти попав у четверту чверть години.');
}  else {
    alert('Твоє значення не підходить. Гру завершено.');
}

//У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = prompt('Загадай число від 1 до 31.');
if (day >= 1 && day <= 10) {
    console.log('Вітаю, твоє число потрапило у першу декаду місяця!');
} else if (day >= 11 && day <= 20) {
    console.log('Вітаю, твоє число потрапило у другу декаду місяця!');
} else if (day >= 21 && day <= 31) {
    console.log('Вітаю, твоє число потрапило у третю декаду місяця!');
} else {
    console.log('Твоє число невірне.')
}

//У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.

let test = 'Something';
if (test === true) {
    console.log('Вірно.');
} else {
    console.log('Неправильно.');
}

// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test2 = (confirm('Вірно чи невірно?')) ? 'Вірно.' : 'Неправильно';
console.log(test2);

//Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3.

alert('Я загадала одне з цих чисел: "-1, 0, 3". Cпробуєш відгадати?')
let a = +prompt('Введи своє число:')
if (a !== 0 && a !== '') {
    console.log('Вірно. Ти вгадав.');
} else {
    console.log('Невірно.');
}

//Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

let schedule = +prompt('Введи порядковий номер дня тижня:')
switch (schedule) {
    case 1:
        document.write(`<h2>Понеділок:</h2>
<ol>
<li>Купити продукти.</li>
<li>Подивитися 1 серію серіалу.</li>
</ol>`);
        break;

    case 2:
        document.write(`<h2>Вівторок</h2>
<ol>
<li>Вивчити вірш.</li>
</ol>`);
        break;
    case 3:
        document.write(`<h2>Середа</h2>
<ol>
<li>Приготувати обід.</li>
</ol>`);
        break;
    case 4:
        document.write(`<h2>Четвер</h2>
<ol>
<li>Поскладати речі в шафі.</li>
<li>Купити сукню.</li>
</ol>`);
        break;
    case 5:
        document.write(`<h2>П'ятниця</h2>
<ol>
<li>Піти на вечірку.</li>
</ol>`);
        break;
    case 6:
        document.write(`<h2>Субота</h2>
<ol>
<li>Генеральне приюирання.</li>
</ol>`);
        break;
    case 7:
        document.write(`<h2>Неділя</h2>
<ol>
<li>Зустрітись з друзями.</li>
</ol>`);
        break;
default:
    document.write(`<h2>Ти щось неправильно ввів.</h2>`);
}


//Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let whichYear = +prompt('Введи рік:');
if ((whichYear % 4) === 0) {
    console.log('Цей рік високосний.');
} else {
    console.log('Даний рік не високосний.');
}


//Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let nameJs = prompt('Яка «офіційна» назва JavaScript?');
if (nameJs === 'ECMAScript') {
    console.log('Правильно!');
} else {
    console.log('Не знаєте? ECMAScript!!');
}
